Update README.md
Version 3.  gave up on mermaid and used good oldfashioned aschiiflow.
